<?php
!defined('ABSPATH') && exit; // exit if WordPress isn't loaded - Game over
//echo __DIR__ . DIRECTORY_SEPARATOR .'vhapdoc.php';
?>
<div class="wrap">
  <h1>VHAP описание</h1>
  <p>
    Плагин содержит только административную часть - только свои настройки, примеры полей и больше ничего.
  </p>
  <p>
Страницы настройки плагина в WordPress делаются довольно запутанно.<br> 
Обычно получается большая простыня кода, в которой сходу разобраться трудно.<br> 
Разбил код на 4 логических блока, чтобы было короче проще и понятнее.
  </p>

<h2>1 — Разовые действия при активации, деактивации, удалении плагина</h2>
<p>
  Это полезно, когда нужно как-то подготовить плагин к работе. 
  Например, создать собственную таблицу в базе данных и все почистить при удалении плагина.<br>
  В принципе, для небольшого, простого плагина ничего этого может быть и не нужно. WordPress все сделает сам.<br>
  Функции - register_activation_hook(), register_deactivation_hook(), register_uninstall_hook()
</p>
<h2>2 — Настройка меню</h2>
<p>
  Вот тут нужно решить, где будет вызываться страница настройки плагина.<br> 
  Варианты такие:<br>
  - Отдельный пункт в главном меню админки - Top Level Menu - 
  это то, что вертикально слева (Консоль, Записи, Медиафайлы, Страницы ... - вот это вот все).<br>
  Так, например, делает "Contact Form 7" или "Yoast SEO", но это когда плагин уже "взрослый" - мощный и популярный<br>
  - Лучше быть скромнее и разместить свою страницу в каком-то из уже существующих пунктов - Submenu.<br>
  Для страниц настроек плагинов обычно используют либо "Инструменты", либо "Настройки".<br>
  Функции - add_menu_page(), add_submenu_page()
</p>
<h2>3 — Сама страница настройки</h2>
<p>
  Самая неочевидная часть.<br> 
  Имеется ввиду, что настройки плагина будут лежать в базе данных WordPress в таблице wp_options (или какой там у вас префикс).<br>
  И в процессе работы плагин будет доставать опции функцией get_option('my_option_name').<br>
  Соответственно, надо сначала зарегистрировать опции register_setting(), 
  потом добавить связанное с опцией поле на странице настроек add_settings_field().<br>
  Поле может быть чекбоксом, радиокнопкой, обычным текстовым text или textarea, в общем любой input html формы - &lt;form&gt;.<br> 
  Еще нужно определить коллбек к add_settings_field(), который будет отвечать за вывод инпута в html виде.<br>
  Далее регистрируются секции, если полей много и их нужно как-то группировать add_settings_section(); если полей мало секция будет одна.<br>
  И наконец, функция, которая все выводит на экран и на которую ссылается меню - это коллбек к add_menu_page/add_submenu_page.<br>
  settings_fields(), do_settings_sections(), submit_button()<br>
  Это прямо совсем упрощенное описание, без нюансов, которых довольно много.
</p>
<h2>4 — Необязательные дополнения</h2>
<p>
Можно добавить оповещение о сохранении настроек, после submit, или сообщения об ошибке, если что-то пошло не так.<br>
Можно добавить валидацию полей при сохранении в таблицу<br>
Своя иконка плагина в меню - WordPress предлагает стандартные из коллекции Dashicons, но можно заменить на свою.<br>
Не совсем относится к странице настроек, но относится к административной части плагина добавление/удаление ссылок в общей таблице плагинов.<br>
Можно, к примеру, удалить ссылку "Деактивация" и пользователь не сможет удалить плагин, и добавить какие-то свои ссылки, 
да хотя бы ссылку на ту же страницу настроек плагина.
</p>
  <p><a href="https://vahro.ru/blog/plugins/vhap-administration-plugin-template">Подробное описание здесь. С картинками.</a></p>
  <?php /* other things here */ ?>
</div>